### Environment: `planning-slack-bot`
#### Terraform Format and Style: `success`
#### Terraform Initialization: `success`
#### Terraform Plan: `success`
<details><summary>Show Plan</summary>

```terraform
aws_ecr_repository.planning_bot: Refreshing state... [id=planning-bot]
aws_acm_certificate.planning_bot: Refreshing state... [id=arn:aws:acm:eu-west-1:198488405862:certificate/b0b99d3d-206b-4615-b132-0edcd12f5a3e]
aws_route53_zone.planning_bot: Refreshing state... [id=Z0148974MYO2TVQBJVOS]
nomad_job.planning_bot: Refreshing state... [id=planning-bot]
aws_route53_record.planning_bot_certificate["fistaszek.makimo.pl"]: Refreshing state... [id=Z0148974MYO2TVQBJVOS__89feef521ce82a7bd023c61cfa59a164.fistaszek.makimo.pl._CNAME]
aws_acm_certificate_validation.planning_bot: Refreshing state... [id=2021-09-03 12:19:46 +0000 UTC]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_route53_record.planning_bot_certificate["fistaszek.makimo.pl"] has been changed
  ~ resource "aws_route53_record" "planning_bot_certificate" {
        id              = "Z0148974MYO2TVQBJVOS__89feef521ce82a7bd023c61cfa59a164.fistaszek.makimo.pl._CNAME"
        name            = "_89feef521ce82a7bd023c61cfa59a164.fistaszek.makimo.pl"
        # (6 unchanged attributes hidden)
    }
  # aws_acm_certificate.planning_bot has been changed
  ~ resource "aws_acm_certificate" "planning_bot" {
        id                        = "arn:aws:acm:eu-west-1:198488405862:certificate/b0b99d3d-206b-4615-b132-0edcd12f5a3e"
      ~ status                    = "PENDING_VALIDATION" -> "ISSUED"
      + tags                      = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lb_listener_certificate.backend will be created
  + resource "aws_lb_listener_certificate" "backend" {
      + certificate_arn = "arn:aws:acm:eu-west-1:198488405862:certificate/b0b99d3d-206b-4615-b132-0edcd12f5a3e"
      + id              = (known after apply)
      + listener_arn    = "arn:aws:elasticloadbalancing:eu-west-1:198488405862:listener/app/hs-external-lb/eb010a8db280300b/9c59c8cc28b7fbe9"
    }

  # aws_route53_record.planning_bot will be created
  + resource "aws_route53_record" "planning_bot" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "fistaszek.makimo.pl"
      + type            = "A"
      + zone_id         = "Z0148974MYO2TVQBJVOS"

      + alias {
          + evaluate_target_health = true
          + name                   = "hs-external-lb-2039142289.eu-west-1.elb.amazonaws.com"
          + zone_id                = "Z32O12XQLNTSW2"
        }
    }

  # aws_wafv2_ip_set.office_ips will be created
  + resource "aws_wafv2_ip_set" "office_ips" {
      + addresses          = [
          + "194.28.48.158/32",
        ]
      + arn                = (known after apply)
      + description        = "Whitelist for Plannig Bot to allows access from office"
      + id                 = (known after apply)
      + ip_address_version = "IPV4"
      + lock_token         = (known after apply)
      + name               = "PlanningBotIPWhitelist"
      + scope              = "REGIONAL"
      + tags_all           = {
          + "Project"    = "PB"
          + "Repository" = "planning-slack-bot"
        }
    }

  # aws_wafv2_regex_pattern_set.planning_bot_host will be created
  + resource "aws_wafv2_regex_pattern_set" "planning_bot_host" {
      + arn         = (known after apply)
      + description = "Planning Bot host regexp"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "PlanningBotHost"
      + scope       = "REGIONAL"
      + tags_all    = {
          + "Project"    = "PB"
          + "Repository" = "planning-slack-bot"
        }

      + regular_expression {
          + regex_string = "^fistaszek.makimo.pl$"
        }
    }

  # aws_wafv2_web_acl.planning_bot will be created
  + resource "aws_wafv2_web_acl" "planning_bot" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "Web ACL that prevents from accessing Planning Bot from outside the office"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "planning-bot-gateway-acl"
      + scope       = "REGIONAL"
      + tags_all    = {
          + "Project"    = "PB"
          + "Repository" = "planning-slack-bot"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "block-non-office"
          + priority = 1

          + action {

              + block {
                }
            }

          + statement {
              + and_statement {
                  + statement {

                      + regex_pattern_set_reference_statement {
                          + arn = (known after apply)

                          + field_to_match {

                              + single_header {
                                  + name = "host"
                                }
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                  + statement {

                      + not_statement {
                          + statement {

                              + ip_set_reference_statement {
                                  + arn = (known after apply)
                                }
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "planning-bot-outside-office"
              + sampled_requests_enabled   = false
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = false
          + metric_name                = "planning-bot-gateway-acl"
          + sampled_requests_enabled   = false
        }
    }

  # nomad_job.planning_bot will be updated in-place
  ~ resource "nomad_job" "planning_bot" {
      ~ allocation_ids          = [
          - "5d392107-a967-4a6f-5595-441e7e03b07c",
        ] -> (known after apply)
        id                      = "planning-bot"
      ~ jobspec                 = <<-EOT
            job "planning-bot" {
              datacenters = ["makimo1"]
              type = "service"
            
              group "bot" {
                network {
                  port "http" { to = 8080 }
                }
            
                task "bot" {
                  driver = "docker"
            
                  config {
                    image = "198488405862.dkr.ecr.eu-west-1.amazonaws.com/planning-bot:9190c4b63452f1e189c029f57419286c1630caca"
                    ports = ["http"]
                  }
            
                  resources {
                    cpu = 500
                    memory = 512
                  }
                }
            
                service {
                  name = "planning-bot"
                  port = "http"
          + 
          +       tags = [
          +         "urlprefix-fistaszek.makimo.pl/"
          +       ]
                }
              }
            }
        EOT
      ~ modify_index            = "61264" -> (known after apply)
        name                    = "planning-bot"
      ~ region                  = "global" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @Struchu, Action: `pull_request`*